bit-finance/Catalogs/бит_ОбъектыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ОбъектыСистемы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Comment>Отключено действие механизма разделения доступа на уровне базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Catalogs/бит_ОбъектыСистемы/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//  Процедура обработчик - перед записью.
// 
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ВидОбъекта) Тогда
	
		Если ЗначениеЗаполнено(Родитель) Тогда		
			ВидОбъекта = Родитель.ВидОбъекта; 		
		КонецЕсли; 
	
	КонецЕсли;    	
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
КонецПроцедуры // ПриЗаписи()

//  Процедура обработчик - при копировании.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.ПустаяСсылка();
	ИмяОбъекта       = "";
	ИмяОбъектаПолное = "";
	ТипЗначенияОбъекта = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Сохраняет тип объекта системы в хранилище значения.
// 
// Параметры:
//  ОписаниеТипов - ОписаниеТипов.
// 
Процедура СохранитьТип(ОписаниеТипов) Экспорт

	МассивТипов = ОписаниеТипов.Типы();
	
	Если МассивТипов.Количество() > 0 Тогда
		
		ТипОбъекта = МассивТипов[0];
		
	Иначе	
		
		ТипОбъекта = Неопределено;
		
	КонецЕсли; 
	
	ТипЗначенияОбъекта = Новый ХранилищеЗначения(ТипОбъекта, Новый СжатиеДанных(9));

КонецПроцедуры // СохранитьТип()

// Функция извлекае тип значения объекта системы из хранилища значения.
// 
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
Функция ПолучитьТипЗначенияОбъекта() Экспорт
	
	ТипОбъекта  = Неопределено;
	
	ХранимыйТип = ТипЗначенияОбъекта.Получить();
	
	Если ТипЗнч(ХранимыйТип) = Тип("Тип") Тогда
		
		МассивВрем = Новый Массив;
		МассивВрем.Добавить(ХранимыйТип);
		
		ТипОбъекта = Новый ОписаниеТипов(МассивВрем);
		
	КонецЕсли; 
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипЗначенияОбъекта()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
